app/controllers/api/v1/presidents_controller.rb

SELECT "presidents".* FROM "presidents"
---
  def index
    @presidents = President.all

SELECT "presidents".* FROM "presidents" WHERE "presidents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @president = President.find(params[:id])